class Lesson7():
    """
      Задание-01

      Создайте переменную с именем `my_var` и присвойте ей значение любой строки
    """
    """ После этой строчки вы должны написать код Задания-01 """

    """ Конец Задания-01. Код к данному заданию должет быть только выше этой строчки """

    ####################################################################################

    """
      Задание-02
      Создайте константу с именем 'MY_CONST` и присвойте ей значение любого целого числа
    """
    """ После этой строчки вы должны написать код Задания-02 """

    """ Конец Задания-02. Код к данному заданию должет быть только выше этой строчки """

    ####################################################################################

    """
      Задание-03
      Напечатайте в консоль "Привет, мир, я Зомби!"
    """

    def test_03(self):
        """ После этой строчки вы должны написать код Задания-03 """

        """ Конец Задания-03. Код к данному заданию должет быть только выше этой строчки """

    ########################################################################################

    """
      Задание-04
      Задайте в консоле вопрос пользователю: "Как твоё имя?: "
      Обратите внимание, что после знака вопроса есть двоеточие и пробел!
    """

    def test_04(self):
        """ После этой строчки вы должны написать код Задания-04 """

        """ Конец Задания-04. Код к данному заданию должет быть только выше этой строчки """

    ########################################################################################

    """
      Задание-05
      Вам даны две переменные `person` и `pet`. Выведите строку, используя функцию форматирования строк
      Строка которую вы должны вывести: "{person} любит своего питомца {pet}". Вместо {person} должно
      подставится значение переменной `person` и вместо {pet} должно подставится значение переменной `pet`.
      Значения переменных вам неизвестны и вы не должны их задавать!
    """

    def test_05(self, person, pet):
        """ После этой строчки вы должны написать код Задания-05 """

        """ Конец Задания-05. Код к данному заданию должет быть только выше этой строчки """

    ########################################################################################

    """
      Задание-06
      Считайте из консоли целое число и присвойте его переменной my_age
    """

    def test_06(self):
        """ После этой строчки вы должны написать код Задания-06 """

        """ Конец Задания-06. Код к данному заданию должет быть только выше этой строчки """

    ########################################################################################

    """
      Задание-07
      Считайте из консоли целое число и присвойте его переменной my_age
    """

    def test_07(self):
        my_age = None
        """ После этой строчки вы должны написать код Задания-07 """

        """ Конец Задания-07. Код к данному заданию должет быть только выше этой строчки """
        return my_age

    ########################################################################################

    """
      Задание-08
      Считайте из консоли число c десятичной точкой и присвойте его переменной my_weight
    """

    def test_08(self):
        my_weight = None
        """ После этой строчки вы должны написать код Задания-08 """

        """ Конец Задания-08. Код к данному заданию должет быть только выше этой строчки """
        return my_weight

    ########################################################################################

    """
      Задание-09
      Вам дана переменная `age`. Если она больше 18, то выведите в консоль: "Ты взрослый! Иди работать".
      Иначе выведите "Есть время отдохнуть!"
    """

    def test_09(self, age):
        """ После этой строчки вы должны написать код Задания-09 """

        """ Конец Задания-09. Код к данному заданию должет быть только выше этой строчки """

    ########################################################################################

    """
      Задание-10
      Вам дана переменная `apples`.
      Если она больше 5, то выведите в консоль: "Каждому по 2, учителю одно!".
      Если она равна 4, то выведите в консоль: "Каждому по 2, учителю гуляш по коридору!"
      Если меньше 4, то выведите в консоль: "Моя прелесть! Всё себе!"
    """

    def test_10(self, apples):
        """ После этой строчки вы должны написать код Задания-10 """

        """ Конец Задания-10. Код к данному заданию должет быть только выше этой строчки """

    ########################################################################################

    """
      Задание-11
      Используя циклы выведите значение переменной `msg` 10 раз в консоль
    """

    def test_11(self, msg):
        """ После этой строчки вы должны написать код Задания-11 """

        """ Конец Задания-11. Код к данному заданию должет быть только выше этой строчки """

    ########################################################################################
