class Lesson7():
    """ 
      Задание-01

      Создайте переменную с именем `my_var` и присвойте ей значение любой строки
    """
    """ После этой строчки вы должны написать код Задания-01 """
    my_var = "Zf"

    """ Конец Задания-01. Код к данному заданию должет быть только выше этой строчки """

    ####################################################################################

    """ 
      Задание-02
      Создайте константу с именем 'MY_CONST` и присвойте ей значение любого целого числа
    """
    """ После этой строчки вы должны написать код Задания-02 """

    MY_CONST = 0

    """ Конец Задания-02. Код к данному заданию должет быть только выше этой строчки """

    ####################################################################################

    """ 
      Задание-03
      Напечатайте в консоль "Привет, мир, я Зомби!"
    """

    def test_03(self):
        """ После этой строчки вы должны написать код Задания-03 """
        print("Привет, мир, я Зомби!")

        """ Конец Задания-03. Код к данному заданию должет быть только выше этой строчки """

    ########################################################################################

    """ 
      Задание-04
      Задайте в консоле вопрос пользователю: "Как твоё имя?: "
      Обратите внимание, что после знака вопроса есть двоеточие и пробел!
    """

    def test_04(self):
        """ После этой строчки вы должны написать код Задания-04 """
        input("Как твоё имя?: ")

        """ Конец Задания-04. Код к данному заданию должет быть только выше этой строчки """

    ########################################################################################
