########################## СПИСКИ ###################################
def test_01(list):
  # Присвойте переменной list пустой список


def test_02(list):
  # Присвойте переменной list список со значениями: [54, 46, 78, 99]


def test_03(list):
  # Удалите из списка list последнее значение.


def test_04(list):
  # Добавьте в список list значения 66 и 34


def test_05(list):
  # Напечатайте 3 элемент списка list.


def test_06(list):
  # Выберите диапазон из списка, начиная с индекса 2 и заканчивая индексом 6, не включая индекс 6.


def test_07(list):
  # Удалите 3 элемент списка


def test_08(list_1, list_2):
  # Соедините(сконкатенируйте) списки list_1 и list_2


def test_09(list):
  # Проверьте входит ли значение 5 в список list. Если входит, то напечатайте "Входит". Если не входит, то напечатайте "Не входит"

    ######################## КОРТЕЖИ ##################################


def test_10(tuple):
  # Создайте кортеж с элементами 34, 56, 67 и присвойте его переменной tuple


def test_11(tuple):
  # Напечатайте 3 элемент кортежа tuple


def test_12(tuple):
  # Выберите и напечатайте диапазон в кортеже начиная с его начала и заканчивая 8 элементом.


def test_13(tuple):
  # Ты дошел сюда! Это чертов тест, ведь он тринадцатый. Задание таково:
  # Выберите и напечатайте диапазон в кортеже начиная с его начала и заканчивая 8 элементом. Но теперь с шагом 2


def test_14(tuple):
  # Присвойте переменным a, b, c значения из кортежа tuple.

    ############################### СЛОВАРИ ###############################


def test_15(dict):
  # Присвойте переменной dict словарь со следующими тремя парами ключ-значение:
  # "one" : 11
  # "two" : 22
  # "three" : 33
